wimalopaan/wmucpp/include_stm32/pwm.h
//                 static inline constexpr uint16_t onems = freq / 1000;
//                 static inline constexpr uint16_t mid   = onems + onems / 2;
                
//                 // std::integral_constant<uint16_t, onems>::_;
                
//                 static inline void reset() {
//                     IO::outl<debug>("# PwmInOut reset");
//                     const auto rcc = Mcu::Stm::Address<Mcu::Components::Rcc>::value;
//                     if constexpr (TimerNumber == 3) {
//                         rcc->APBRSTR1 = RCC_APBRSTR1_TIM3RST;
//                         rcc->APBRSTR1 &= ~RCC_APBRSTR1_TIM3RST;
//                     }
//         #ifdef STM32G0B1xx
//                     else if constexpr (TimerNumber == 4) {
//                         rcc->APBRSTR1 = RCC_APBRSTR1_TIM4RST;
//                         rcc->APBRSTR1 &= ~RCC_APBRSTR1_TIM4RST;
//                     }
//         #endif
//                     else {
//                         static_assert(false);
//                     }
//                     pin_in_1::analog();
//                     pin_in_2::analog();
//                     pin_out_1::analog();
//                     pin_out_2::analog();
//                 }
                
// // #ifdef STM32G0
//                 static inline void init() {
//                     IO::outl<debug>("# PwmInOut init");
//                     if constexpr (TimerNumber == 1) {
//                         RCC->APBENR2 |= RCC_APBENR2_TIM1EN;
//                     }
// #ifdef RCC_APBENR1_TIM2EN
//                     else if constexpr (TimerNumber == 2) {
//                         RCC->APBENR1 |= RCC_APBENR1_TIM2EN;
//                     }
// #endif
//                     else if constexpr (TimerNumber == 3) {
//                         RCC->APBENR1 |= RCC_APBENR1_TIM3EN;
//                     }
//                     else if constexpr (TimerNumber == 14) {
//                         RCC->APBENR2 |= RCC_APBENR2_TIM14EN;
//                     }
//                     else if constexpr (TimerNumber == 17) {
//                         RCC->APBENR2 |= RCC_APBENR2_TIM17EN;
//                     }
//                     else {
//                         static_assert(false);
//                     }
                    
//                     mcuTimer->PSC = prescaler - 1;
//                     mcuTimer->ARR = period;
//                     // mcuTimer->CCMR1 |= (0b0110 << TIM_CCMR1_OC1M_Pos); // pwm1
//                     // mcuTimer->CCMR1 |= (0b0110 << TIM_CCMR1_OC2M_Pos); // pwm2
//                     mcuTimer->CCMR2 |= (0b0110 << TIM_CCMR2_OC3M_Pos); // pwm3
//                     mcuTimer->CCMR2 |= (0b0110 << TIM_CCMR2_OC4M_Pos); // pwm4
//                     // mcuTimer->CCER |= TIM_CCER_CC1E;
//                     // mcuTimer->CCER |= TIM_CCER_CC2E;
//                     mcuTimer->CCER |= TIM_CCER_CC3E;
//                     mcuTimer->CCER |= TIM_CCER_CC4E;

//                     if constexpr ((TimerNumber == 1) || (TimerNumber == 17)) {
//                         mcuTimer->BDTR |= TIM_BDTR_MOE;
//                         mcuTimer->CCER |= TIM_CCER_CC1E;
//                     }
//                     if constexpr ((TimerNumber == 17)) { // hack
//                         mcuTimer->CCER |= TIM_CCER_CC1NE;
//                     }
//                     // mcuTimer->CCR1 = 0;
//                     // mcuTimer->CCR2 = 0;
//                     mcuTimer->CCR3 = mid;
//                     mcuTimer->CCR4 = mid;
//                     mcuTimer->CR1 |= TIM_CR1_ARPE;

// #if 1
//                     MODIFY_REG(mcuTimer->TISEL, TIM_TISEL_TI1SEL_Msk, 0); // input CH1
//                     MODIFY_REG(mcuTimer->CCMR1, TIM_CCMR1_CC1S_Msk, 0b01 << TIM_CCMR1_CC1S_Pos); // TI1 -> IC1
//                     MODIFY_REG(mcuTimer->CCMR1, TIM_CCMR1_CC2S_Msk, 0b10 << TIM_CCMR1_CC2S_Pos); // TI1 -> IC2
//                     if (mStartPositiv) {
//                         mcuTimer->CCER &= ~(TIM_CCER_CC1P | TIM_CCER_CC1NP); // IC1: positive
//                         mcuTimer->CCER &= ~TIM_CCER_CC2NP; // IC2: negative
//                         mcuTimer->CCER |= TIM_CCER_CC2P;
//                     }
//                     else {
//                         mcuTimer->CCER &= ~(TIM_CCER_CC2P | TIM_CCER_CC2NP); // IC2: positive
//                         mcuTimer->CCER &= ~TIM_CCER_CC1NP; // IC1: negative
//                         mcuTimer->CCER |= TIM_CCER_CC1P;
//                     }
//                     MODIFY_REG(mcuTimer->SMCR, TIM_SMCR_TS_Msk, TIM_SMCR_TS_0 | TIM_SMCR_TS_2); // TI1FP1 as Trigger
//                     MODIFY_REG(mcuTimer->SMCR, TIM_SMCR_SMS_Msk, 0b0100); // slave mode: reset
//                     mcuTimer->CCER |= TIM_CCER_CC1E;
//                     mcuTimer->CCER |= TIM_CCER_CC2E;
        
//                     mcuTimer->DIER |= TIM_DIER_CC1DE; // dma enable
        
//                     dmaCh1::init();
//                     dmaCh1::startRead(1, (uint32_t)&mcuTimer->DMAR, &mData, Mcu::Stm::Timers::Properties<TimerNumber>::dmamux_src[0]);
                    
//                     // MODIFY_REG(mcuTimer->DCR, TIM_DCR_DBL_Msk, 0x01 << TIM_DCR_DBL_Pos); // Burstlenth = 2
        
//         //             static constexpr uint16_t ccr1Offset = offsetof(TIM_TypeDef, CCR1) / 4;
//         //             static_assert(offsetof(TIM_TypeDef, CR1) == 0);
//         //             static_assert(offsetof(TIM_TypeDef, CR2) == 4);
        
//         //             MODIFY_REG(mcuTimer->DCR, TIM_DCR_DBA_Msk, ccr1Offset << TIM_DCR_DBA_Pos);
// #endif
                    
//                     mcuTimer->CR1 |= TIM_CR1_CEN;
        
//                     pin_in_1::afunction(pin_in_1_af);
//                     pin_in_1::template dir<Mcu::Input>();
                    
//                     pin_out_1::afunction(pin_out_1_af);
//                     pin_out_1::template dir<Mcu::Output>();
                    
//                     pin_in_2::analog();
//                     pin_out_2::analog();
//                 }
// // #endif
//                 static inline void duty3(const uint16_t v) {
//                     mcuTimer->CCR3 = v;
//                 }
//                 static inline void duty4(const uint16_t v) {
//                     mcuTimer->CCR4 = v;
//                 }
                
//             private:
//                 static inline bool mStartPositiv = true;
//                 static inline uint16_t mData = 0;
                
//             };
        }
    }
    namespace V2 {
        namespace Pwm {
            template<uint8_t TimerNumber, typename Clock, typename MCU = DefaultMcu>
            struct Simple {
                static inline /*constexpr */ TIM_TypeDef* const mcuTimer = reinterpret_cast<TIM_TypeDef*>(Mcu::Stm::Address<Mcu::Components::Timer<TimerNumber>>::value);

